CommunityGD32Cores/GD32Firmware/GD32L23x/GD32L23x_standard_peripheral/Include/gd32l23x_lptimer.h
/*!
    \file    gd32l23x_lptimer.h
    \brief   definitions for the LPTIMER

    \version 2021-08-04, V1.0.0, firmware for GD32L23x
*/

/*
    Copyright (c) 2021, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32L23X_LPTIMER_H
#define GD32L23X_LPTIMER_H

#include "gd32l23x.h"

/* LPTIMER definitions */
#define LPTIMER                             LPTIMER_BASE

/* registers definitions */
#define LPTIMER_INTF                        REG32(LPTIMER + 0x00U)              /*!< interrupt flag register */
#define LPTIMER_INTC                        REG32(LPTIMER + 0x04U)              /*!< interrupt flag clear register */
#define LPTIMER_INTEN                       REG32(LPTIMER + 0x08U)              /*!< interrupt enable register */
#define LPTIMER_CTL0                        REG32(LPTIMER + 0x0CU)              /*!< control register 0 */
#define LPTIMER_CTL1                        REG32(LPTIMER + 0x10U)              /*!< control register 1 */
#define LPTIMER_CMPV                        REG32(LPTIMER + 0x14U)              /*!< compare value register */
#define LPTIMER_CAR                         REG32(LPTIMER + 0x18U)              /*!< counter auto reload register */
#define LPTIMER_CNT                         REG32(LPTIMER + 0x1CU)              /*!< counter register */
#define LPTIMER_EIRMP                       REG32(LPTIMER + 0x20U)              /*!< external input remap register */
#define LPTIMER_INHLCMV                     REG32(LPTIMER + 0x24U)              /*!< input high level counter max value register */

/* bits definitions */
/* LPTIMER_INTF */
#define LPTIMER_INTF_CMPVMIF                BIT(0)                              /*!< compare value register match interrupt flag */
#define LPTIMER_INTF_CARMIF                 BIT(1)                              /*!< counter auto reload register match interrupt flag */
#define LPTIMER_INTF_ETEDEVIF               BIT(2)                              /*!< external trigger edge event interrupt flag */
#define LPTIMER_INTF_CMPVUPIF               BIT(3)                              /*!< compare value register update interrupt flag */
#define LPTIMER_INTF_CARUPIF                BIT(4)                              /*!< counter auto reload register update interrupt flag */
#define LPTIMER_INTF_UPIF                   BIT(5)                              /*!< LPTIMER counter direction change down to up interrupt flag */
#define LPTIMER_INTF_DOWNIF                 BIT(6)                              /*!< LPTIMER counter direction change up to down interrupt flag */
#define LPTIMER_INTF_HLCMVUPIF              BIT(26)                             /*!< input high level counter max value register update interrupt flag */
#define LPTIMER_INTF_INHLCOIF               BIT(27)                             /*!< LPTIMER_INx(x=0,1) high level counter overflow interrupt flag */
#define LPTIMER_INTF_INHLOEIF               BIT(28)                             /*!< the high level of LPTIMER_IN0 and LPTIMER_IN1 overlap error interrupt flag */
#define LPTIMER_INTF_INRFOEIF               BIT(29)                             /*!< the falling and rising edges of LPTIMER_IN0 and LPTIMER_IN1 overlap error interrupt flag */
#define LPTIMER_INTF_IN0EIF                 BIT(30)                             /*!< LPTIMER_IN0 error interrupt flag */
#define LPTIMER_INTF_IN1EIF                 BIT(31)                             /*!< LPTIMER_IN1 error interrupt flag */

/* LPTIMER_INTC */
#define LPTIMER_INTC_CMPVMIC                BIT(0)                              /*!< compare value register match interrupt flag clear bit */
#define LPTIMER_INTC_CARMIC                 BIT(1)                              /*!< counter auto reload register match interrupt flag clear bit */
#define LPTIMER_INTC_ETEDEVIC               BIT(2)                              /*!< external trigger edge event interrupt flag clear bit */
#define LPTIMER_INTC_CMPVUPIC               BIT(3)                              /*!< compare value register update interrupt flag clear bit */
#define LPTIMER_INTC_CARUPIC                BIT(4)                              /*!< counter auto reload register update interrupt flag clear bit */
#define LPTIMER_INTC_UPIC                   BIT(5)                              /*!< LPTIMER counter direction change down to up interrupt flag clear bit */
#define LPTIMER_INTC_DOWNIC                 BIT(6)                              /*!< LPTIMER counter direction change up to down interrupt flag clear bit */
#define LPTIMER_INTC_HLCMVUPIC              BIT(26)                             /*!< input high level counter max value register update interrupt flag clear bit */
#define LPTIMER_INTC_INHLCOIC               BIT(27)                             /*!< LPTIMER_INx(x=0, 1) high level counter overflow interrupt flag clear bit */
#define LPTIMER_INTC_INHLOEIC               BIT(28)                             /*!< the high level of LPTIMER_IN0 and LPTIMER_IN1 overlap error interrupt flag clear bit */
#define LPTIMER_INTC_INRFOEIC               BIT(29)                             /*!< the falling and rising edges of LPTIMER_IN0 and LPTIMER_IN1 overlap error interrupt flag clear bit */
#define LPTIMER_INTC_IN0EIC                 BIT(30)                             /*!< LPTIMER_IN0 error interrupt flag clear bit */
#define LPTIMER_INTC_IN1EIC                 BIT(31)                             /*!< LPTIMER_IN1 error interrupt flag clear bit */

/* LPTIMER_INTEN */
#define LPTIMER_INTEN_CMPVMIE               BIT(0)                              /*!< compare value register match interrupt enable bit */
#define LPTIMER_INTEN_CARMIE                BIT(1)                              /*!< counter auto reload register match interrupt enable bit */
#define LPTIMER_INTEN_ETEDEVIE              BIT(2)                              /*!< external trigger edge event interrupt enable bit */
#define LPTIMER_INTEN_CMPVUPIE              BIT(3)                              /*!< compare value register update interrupt enable bit */
#define LPTIMER_INTEN_CARUPIE               BIT(4)                              /*!< counter auto reload register update interrupt enable bit */
#define LPTIMER_INTEN_UPIE                  BIT(5)                              /*!< LPTIMER counter direction change down to up interrupt enable bit */
#define LPTIMER_INTEN_DOWNIE                BIT(6)                              /*!< LPTIMER counter direction change up to down interrupt enable bit */
#define LPTIMER_INTEN_HLCMVUPIE             BIT(26)                             /*!< input high level counter max value register update interrupt enable bit */
#define LPTIMER_INTEN_INHLCOIE              BIT(27)                             /*!< LPTIMER_INx(x=0,1) high level counter overflow interrupt enable bit */
#define LPTIMER_INTEN_INHLOEIE              BIT(28)                             /*!< the high level of LPTIMER_IN0 and LPTIMER_IN1 overlap error interrupt enable bit */
#define LPTIMER_INTEN_INRFOEIE              BIT(29)                             /*!< the falling and rising edges of LPTIMER_IN0 and LPTIMER_IN1 overlap error interrupt enable bit */
#define LPTIMER_INTEN_IN0EIE                BIT(30)                             /*!< LPTIMER_IN0 error interrupt enable bit */
#define LPTIMER_INTEN_IN1EIE                BIT(31)                             /*!< LPTIMER_IN1 error interrupt enable bit */

/* LPTIMER_CTL0 */
#define LPTIMER_CTL0_CKSSEL                 BIT(0)                              /*!< clock source select */
#define LPTIMER_CTL0_CKPSEL                 BITS(1, 2)                          /*!< clock polarity select */
#define LPTIMER_CTL0_ECKFLT                 BITS(3, 4)                          /*!< external clock filter */
#define LPTIMER_CTL0_TFLT                   BITS(6, 7)                          /*!< trigger filter */
#define LPTIMER_CTL0_PSC                    BITS(9, 11)                         /*!< clock prescaler selection */
#define LPTIMER_CTL0_ETSEL                  BITS(13, 15)                        /*!< external trigger select */
#define LPTIMER_CTL0_ETMEN                  BITS(17, 18)                        /*!< external trigger mode enable */
#define LPTIMER_CTL0_TIMEOUT                BIT(19)                             /*!< timeout enable */
#define LPTIMER_CTL0_OMSEL                  BIT(20)                             /*!< output mode select */
#define LPTIMER_CTL0_OPSEL                  BIT(21)                             /*!< output polarity select */
#define LPTIMER_CTL0_SHWEN                  BIT(22)                             /*!< LPTIMER_CAR and LPTIMER_CMPV shadow registers enable */
#define LPTIMER_CTL0_CNTMEN                 BIT(23)                             /*!< counter mode select */
#define LPTIMER_CTL0_DECMEN                 BIT(24)                             /*!< decoder mode enabled */
#define LPTIMER_CTL0_DECMSEL                BIT(25)                             /*!< decoder mode select */

/* LPTIMER_CTL1 */
#define LPTIMER_CTL1_LPTEN                  BIT(0)                              /*!< LPTIMER enable */
#define LPTIMER_CTL1_SMST                   BIT(1)                              /*!< LPTIMER start in single counting mode */
#define LPTIMER_CTL1_CTNMST                 BIT(2)                              /*!< LPTIMER start in continus counting mode */
#define LPTIMER_CTL1_LPTENF                 BIT(30)                             /*!< LPTIMER enable from LPTIMER core */
#define LPTIMER_CTL1_INHLCEN                BIT(31)                             /*!< LPTIMER external input high level counter enable */

/* LPTIMER_CMPV */
#define LPTIMER_CMPV_CMPVAL                 BITS(0, 31)                          /*!< compare value */

/* LPTIMER_CAR */
#define LPTIMER_CAR_CARL                    BITS(0, 31)                          /*!< counter auto reload value */

/* LPTIMER_CNT */
#define LPTIMER_CNT_CNT                     BITS(0, 31)                          /*!< counter value */

