CommunityGD32Cores/GD32Firmware/GD32L23x/GD32L23x_standard_peripheral/Include/gd32l23x_lptimer.h
/* read and configure LPTIMER register value */
/* read LPTIMER current counter value */
uint32_t lptimer_counter_read(void);
/* read LPTIMER auto reload value */
uint32_t lptimer_autoreload_read(void);
/* read the compare value */
uint32_t lptimer_compare_read(void);
/* configure LPTIMER autoreload register value */
void lptimer_autoreload_value_config(uint32_t autoreload);
/* configure LPTIMER compare value */
void lptimer_compare_value_config(uint32_t compare);

/* LPTIMER decode mode */
/* enable decode mode 0 */
void lptimer_decodemode0_enable(void);
/* enable decode mode 1 */
void lptimer_decodemode1_enable(void);
/* disable decode mode 0/1 */
void lptimer_decodemode_disable(void);

/* LPTIMER input high level counter */
/* enable external input high level counter */
void lptimer_highlevelcounter_enable(uint32_t maxvalue);
/* disable external input high level counter */
void lptimer_highlevelcounter_disable(void);

/* LPTIMER interrupt and flag */
/* get LPTIMER flags */
FlagStatus lptimer_flag_get(uint32_t flag);
/* clear LPTIMER flags */
void lptimer_flag_clear(uint32_t flag);
/* enable the LPTIMER interrupt */
void lptimer_interrupt_enable(uint32_t interrupt);
/* disable the LPTIMER interrupt */
void lptimer_interrupt_disable(uint32_t interrupt);
/* get LPTIMER interrupt flag */
FlagStatus lptimer_interrupt_flag_get(uint32_t int_flag);
/* clear LPTIMER interrupt flag */
void lptimer_interrupt_flag_clear(uint32_t int_flag);

#endif /* GD32L23X_LPTIMER_H */
